---
type: StructuralSectionLProfile
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionLProfile

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfile` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionLProfile | 2016 | `public StructuralSectionLProfile ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double centroidHorizontal , double centroidVertical , double principalAxes` |